
[
  {
    "id": 1,
    "week": 1,
    "trimester": 1,
    "phase": "Pre-conception",
    "fetal_development": "Not technically pregnant yet - your partner's body is preparing for ovulation like a construction site being cleared and prepared for a major project. The uterine lining is building up to create the perfect environment for implantation, while hormones orchestrate the release of an egg.",
    "maternal_hormones": "Estrogen and progesterone fluctuating with menstrual cycle, creating the hormonal foundation necessary for supporting early pregnancy. FSH (follicle-stimulating hormone) is preparing eggs for release.",
    "paternal_changes": "Beginning awareness of pregnancy planning phase - you're like an architect reviewing blueprints before construction begins. Your role in providing healthy sperm and emotional support starts now.",
    "medical_appointments": "Pre-pregnancy consultation if planning - discuss genetic history, medications, and lifestyle factors that could affect conception and early development.",
    "baby_size_comparison": "",
    "baby_size_inches": 0,
    "baby_weight_grams": 0,
    "emotional_patterns": "Excitement mixed with planning anxiety - the anticipation of starting this journey can be both thrilling and overwhelming.",
    "anxiety_triggers": "Financial planning concerns, timing worries, uncertainty about fertility and the journey ahead.",
    "bonding_opportunities": "Plan for pregnancy together, discuss parenting goals, create a supportive environment for conception. This is your chance to align your visions for parenthood.",
    "actionable_tasks": "Begin taking prenatal vitamins (both partners benefit), stop smoking, reduce alcohol, review medications with healthcare provider, ensure healthy diet rich in folic acid.",
    "common_questions": "When should we start trying? What lifestyle changes are needed? How long does conception typically take?",
    "safety_considerations": "Avoid harmful substances that could affect sperm quality - heat exposure, certain medications, recreational drugs. Sperm take 74 days to mature, so changes you make now affect conception months ahead.",
    "communication_focus": "Discuss hopes and expectations for parenthood - this foundation of communication will serve you throughout pregnancy and beyond.",
    "did_you_know": "Pregnancy weeks are counted from last menstrual period because ovulation timing varies, so conception hasn't occurred yet. This standardized counting helps healthcare providers track development accurately.",
    "maternal_symptoms_changes": "Menstrual period occurring, body preparing for potential conception by building nutrient-rich uterine lining.",
    "risk_indicators": "None specific to pregnancy since conception hasn't occurred.",
    "when_to_seek_medical_help": "For unusual menstrual concerns or pre-conception health questions."
  },
  {
    "id": 2,
    "week": 2,
    "trimester": 1,
    "phase": "Conception window",
    "fetal_development": "Ovulation and potential fertilization occur around end of week 2. If conception happens, it's a remarkable molecular dance - one sperm out of millions navigates the female reproductive tract, penetrates the egg's protective layers, and delivers genetic material that combines with the egg's DNA to create your unique child.",
    "maternal_hormones": "LH surge triggering ovulation (like a starter pistol for the race), estrogen peak creating optimal conditions for sperm survival and transport through cervical mucus.",
    "paternal_changes": "Supporting healthy conception environment - your sperm are on an incredible journey that requires optimal health. The winning sperm has traveled the equivalent of a marathon at the cellular level.",
    "medical_appointments": "None typically scheduled, though ovulation tracking might be occurring at home.",
    "baby_size_comparison": "a single cell",
    "baby_size_inches": 0,
    "baby_weight_grams": 0,
    "emotional_patterns": "Anticipation and hope mixed with uncertainty about timing.",
    "anxiety_triggers": "Conception timing concerns, performance anxiety, worry about fertility. Remember conception is successful only 20-25% of the time even with perfect timing.",
    "bonding_opportunities": "Understand conception process together - learning about fertility helps both partners feel involved. This is a team effort from the very beginning.",
    "actionable_tasks": "Continue healthy lifestyle, be supportive during fertile window, maintain regular intimate connection without pressure, understand that conception may take several months.",
    "common_questions": "How do we know when ovulation occurs? What increases conception chances? Is there such a thing as trying too hard?",
    "safety_considerations": "Avoid stress, maintain healthy habits, keep testicles cool (no hot tubs/saunas), maintain healthy weight. Stress hormones can affect both sperm production and ovulation.",
    "communication_focus": "Support during fertile window - understanding that pressure can be counterproductive to conception.",
    "did_you_know": "Baby's sex is determined at fertilization by father's sperm - X chromosome for female, Y for male. This single moment of genetic combination creates a unique individual who has never existed before.",
    "maternal_symptoms_changes": "Ovulation occurring (may notice mittleschmerz - ovulation pain), fertile cervical mucus resembling egg whites, slight temperature rise after ovulation.",
    "risk_indicators": "None specific to pregnancy yet.",
    "when_to_seek_medical_help": "For fertility concerns after 6+ months trying (12+ months if under 35)."
  },
  {
    "id": 3,
    "week": 3,
    "trimester": 1,
    "phase": "Early implantation",
    "fetal_development": "Fertilization creates a zygote that immediately begins dividing while traveling down the fallopian tube. By day 3-4, it's a morula (solid ball of cells), then transforms into a blastocyst (hollow ball) by day 5. The blastocyst 'hatches' from its protective shell and begins the critical process of implantation - literally burrowing into the uterine wall to establish the life-support connection with mother.",
    "maternal_hormones": "hCG production beginning at implantation (the hormone pregnancy tests detect), progesterone maintaining uterine lining like scaffolding supporting a construction site.",
    "paternal_changes": "Early pregnancy awareness developing, though you may not know conception occurred. Some fathers report intuitive feelings that 'something is different.'",
    "medical_appointments": "None typically scheduled - most couples don't know pregnancy has begun.",
    "baby_size_comparison": "a pinhead",
    "baby_size_inches": 0.01,
    "baby_weight_grams": 0,
    "emotional_patterns": "Cautious optimism if conception suspected, uncertainty about whether this is 'the month.'",
    "anxiety_triggers": "Uncertainty about conception success, watching for early signs, resisting the urge to test too early.",
    "bonding_opportunities": "Learn about early development together - understanding the complexity happening at microscopic levels deepens appreciation for the process.",
    "actionable_tasks": "Be aware of potential early pregnancy signs, maintain supportive environment, avoid pressuring for early testing (hCG needs time to build up for accurate results).",
    "common_questions": "Did conception occur? How early can we test? What's happening inside if we did conceive?",
    "safety_considerations": "Avoid alcohol, smoking, harmful substances just in case. The neural tube forms before many women know they're pregnant, making pre-conception health crucial.",
    "communication_focus": "Early pregnancy awareness and support - being patient with the uncertainty of early pregnancy.",
    "did_you_know": "Baby's cells are already differentiating into two types: inner cell mass (becomes baby) and trophoblast (becomes placenta). This early specialization sets the stage for all future development.",
    "maternal_symptoms_changes": "Implantation may cause light spotting (often mistaken for light period), mild cramping, breast tenderness beginning, fatigue starting as progesterone rises.",
    "risk_indicators": "Watch for signs of ectopic pregnancy (severe one-sided pain, heavy bleeding).",
    "when_to_seek_medical_help": "Too early for accurate pregnancy test - wait until missed period for reliable results."
  },
  {
    "id": 4,
    "week": 4,
    "trimester": 1,
    "phase": "Confirmation",
    "fetal_development": "The blastocyst has implanted and is now an embryo. Neural tube formation begins - imagine a flat sheet of cells rolling into a tube like paper becoming a telescope. This tube will become your baby's entire central nervous system. The edges must meet and seal perfectly; any gaps cause neural tube defects. This is why folic acid taken before conception is critical - it provides the cellular machinery for this precise process.",
    "maternal_hormones": "hCG doubling every 48-72 hours (explaining why pregnancy symptoms intensify daily), progesterone maintaining thick uterine lining, estrogen beginning to rise.",
    "paternal_changes": "Pregnancy confirmation excitement mixed with the overwhelming realization that you're going to be a father. This moment changes everything.",
    "medical_appointments": "Pregnancy test confirmation - home tests now reliable. Schedule first prenatal appointment.",
    "baby_size_comparison": "a poppy seed",
    "baby_size_inches": 0.03,
    "baby_weight_grams": 0,
    "emotional_patterns": "Excitement mixed with overwhelming realization of responsibility, joy tempered with anxiety about the unknown journey ahead.",
    "anxiety_triggers": "Life changes beginning, financial concerns, worries about being a good father, partner's health concerns.",
    "bonding_opportunities": "Take pregnancy test together if possible - sharing this moment creates lasting memories. Begin documenting the journey with photos or journal.",
    "actionable_tasks": "Be emotionally supportive regardless of test results, help schedule prenatal appointment, start learning about pregnancy, begin financial planning for baby.",
    "common_questions": "Is this really happening? What do we do first? How do we tell people? When is it safe to share the news?",
    "safety_considerations": "Partner should stop alcohol and smoking immediately. Critical organ formation begins now. Avoid cat litter (toxoplasmosis risk), raw foods, and harmful chemicals.",
    "communication_focus": "Share feelings about positive test, discuss fears and excitement, plan next steps together.",
    "did_you_know": "Neural tube formation is why folic acid is crucial - it reduces neural tube defect risk by 50-70%. The neural tube forms in week 4, often before women know they're pregnant, highlighting pre-conception vitamin importance.",
    "maternal_symptoms_changes": "Missed period (most obvious sign), breast tenderness increasing, mild nausea possibly beginning, heightened sense of smell, implantation bleeding possible, fatigue from progesterone.",
    "risk_indicators": "Chemical pregnancy (early miscarriage) risk, ectopic pregnancy signs.",
    "when_to_seek_medical_help": "For pregnancy confirmation, severe cramping, heavy bleeding, or to establish prenatal care. Don't wait - early care improves outcomes."
  },
  {
    "id": 5,
    "week": 5,
    "trimester": 1,
    "phase": "Organ formation begins",
    "fetal_development": "Neural tube closes completely - a critical milestone. The heart begins as two tubes that fold and fuse, starting to beat around day 22-23. Brain divides into forebrain (future personality and thinking), midbrain (reflexes), and hindbrain (vital functions like breathing). This week begins organogenesis - the incredible process of building all major organs simultaneously.",
    "maternal_hormones": "hCG levels rising significantly (causing morning sickness), progesterone and estrogen increasing (affecting mood and energy), relaxin beginning production (loosening ligaments).",
    "paternal_changes": "Understanding partner's hormonal changes helps you provide better support. These hormones aren't just numbers - they're causing real physical and emotional effects.",
    "medical_appointments": "Schedule first prenatal appointment if not already done. Early care allows baseline establishment and dating confirmation.",
    "baby_size_comparison": "an apple seed",
    "baby_size_inches": 0.13,
    "baby_weight_grams": 0,
    "emotional_patterns": "Adjustment period as reality sets in, partner may be experiencing significant symptoms while processing pregnancy emotions.",
    "anxiety_triggers": "Partner's symptoms worrying you, concern for baby's health, uncertainty about how to help, fear of miscarriage during vulnerable early weeks.",
    "bonding_opportunities": "Read about development together, start talking to bump even though baby can't hear yet - it helps you bond and process the reality of pregnancy.",
    "actionable_tasks": "Be patient with symptoms, help with nausea relief (ginger, B6, small frequent meals), take over smell-triggering tasks, ensure hydration.",
    "common_questions": "Why is she so sick? Is this normal? How can I help with morning sickness? Should we be worried about the baby?",
    "safety_considerations": "Avoid exposure to harmful chemicals, secondhand smoke. Ensure good ventilation when using cleaning products. Partner should avoid hot tubs and saunas.",
    "communication_focus": "Understanding hormonal changes affecting partner - knowledge reduces frustration and increases empathy.",
    "did_you_know": "Baby's heart begins beating around day 22-23, though too small to detect yet. It beats about 105 times per minute - almost twice your resting heart rate because it's working hard to establish circulation.",
    "maternal_symptoms_changes": "Morning sickness may begin (affects 70-80% of pregnancies), extreme fatigue (body is building a placenta), frequent urination, food aversions developing, emotional volatility.",
    "risk_indicators": "Severe morning sickness (hyperemesis gravidarum) if can't keep fluids down.",
    "when_to_seek_medical_help": "If partner can't keep fluids down for 24 hours, has signs of dehydration (dark urine, dizziness), or loses more than 5% body weight."
  },
  {
    "id": 6,
    "week": 6,
    "trimester": 1,
    "phase": "Heartbeat begins",
    "fetal_development": "Heart now beating strongly at 110-160 bpm and may be detectable on ultrasound - an emotional milestone for many fathers. The heart has divided into four chambers with valves beginning to form. Brain development accelerates with neural connections forming at an astounding rate of 250,000 neurons per minute. Arm and leg buds appear like tiny paddles.",
    "maternal_hormones": "Hormone levels continue rising dramatically, hCG approaching peak (maximum morning sickness), placenta beginning hormone production takeover from corpus luteum.",
    "paternal_changes": "Learning to support partner through morning sickness. This is often the hardest time physically for pregnant women, requiring maximum support and patience.",
    "medical_appointments": "First prenatal appointment often scheduled around this time. May include dating ultrasound, blood work, medical history, genetic screening discussion.",
    "baby_size_comparison": "a lentil",
    "baby_size_inches": 0.25,
    "baby_weight_grams": 0,
    "emotional_patterns": "Worry mixed with excitement about hearing heartbeat, reality of pregnancy becoming more concrete with medical confirmation.",
    "anxiety_triggers": "Partner's severe sickness, miscarriage fears (risk is actually decreasing), feeling helpless watching partner suffer, work-life balance concerns.",
    "bonding_opportunities": "Potential first ultrasound - seeing heartbeat is powerful bonding moment. Take video if allowed. This makes pregnancy feel real for many fathers.",
    "actionable_tasks": "Maximum support needed: take over cooking (smells trigger nausea), grocery shopping, household cleaning, pet care. Create nausea kit: crackers, ginger candy, sea bands.",
    "common_questions": "When will we hear the heartbeat? Is sickness this bad normal? What if she can't work? How do we handle telling employers?",
    "safety_considerations": "Monitor for dehydration signs: decreased urination, dry mouth, dizziness, rapid heartbeat. Dehydration can worsen nausea and harm baby.",
    "communication_focus": "Supporting partner through morning sickness - your patience and care during this difficult time strengthens your relationship.",
    "did_you_know": "Heart beats approximately 150 times per minute and circulates blood through a simple loop. The heart is the first organ to function because growing tissues need oxygen and nutrients to develop.",
    "maternal_symptoms_changes": "Morning sickness often peaks, extreme fatigue, mood swings from hormonal fluctuations, breast tenderness increasing, visible veins as blood volume increases 50%.",
    "risk_indicators": "Hyperemesis gravidarum (severe persistent vomiting), dehydration, weight loss exceeding 5% of pre-pregnancy weight.",
    "when_to_seek_medical_help": "For severe vomiting preventing fluid/food intake, dehydration symptoms, fainting, severe abdominal pain, or vaginal bleeding beyond light spotting."
  },
  {
    "id": 7,
    "week": 7,
    "trimester": 1,
    "phase": "Brain development",
    "fetal_development": "Brain development accelerates dramatically - it's growing at 250,000 new neurons per minute. Major brain regions are established and beginning specialization. Limb buds now show distinct segments that will become arms and legs. Facial features begin forming with eye spots, nasal pits, and ear indentations visible. Internal organs continue rapid development with liver producing blood cells.",
    "maternal_hormones": "Continued hormone surges affecting every body system. Placenta development accelerating to take over hormone production. hCG levels near peak, explaining intense symptoms.",
    "paternal_changes": "Patience with partner's symptoms crucial. Food aversions and cravings reflect evolutionary protection mechanisms - body avoiding potentially harmful foods and seeking needed nutrients.",
    "medical_appointments": "First prenatal visit if not completed. Important to establish care relationship and baseline health markers.",
    "baby_size_comparison": "a blueberry",
    "baby_size_inches": 0.5,
    "baby_weight_grams": 0,
    "emotional_patterns": "Partner may be emotional and exhausted, father may feel excluded from pregnancy experience or overwhelmed by partner's needs.",
    "anxiety_triggers": "Feeling helpless with partner's symptoms, work productivity concerns for both parents, financial worries increasing, relationship strain from symptoms.",
    "bonding_opportunities": "Notice partner's body changes beginning, imagine baby's rapid development, participate in prenatal appointments when possible, start pregnancy journal.",
    "actionable_tasks": "Grocery shopping for cravings/aversions (keep flexible), emotional support during mood swings, physical comfort measures, maintain household while partner rests.",
    "common_questions": "How long will she feel this sick? What can I do to help? Is it normal for her to be so emotional? Are we prepared for this?",
    "safety_considerations": "Be patient with food aversions and cravings - they're biologically driven, not choices. Ensure nutritional needs are met despite limited food tolerance.",
    "communication_focus": "Discuss how partner is feeling physically and emotionally. Share your own emotions - fathers have pregnancy experiences too.",
    "did_you_know": "Baby has a small tail that will disappear by week 9 - evidence of our evolutionary history. All mammals go through similar developmental stages, showing our shared ancestry.",
    "maternal_symptoms_changes": "Morning sickness continues (may last until week 12-14), food aversions and cravings intensifying, heightened emotions, vivid dreams, increased saliva production.",
    "risk_indicators": "Persistent severe symptoms suggesting hyperemesis gravidarum, signs of depression or severe anxiety.",
    "when_to_seek_medical_help": "For uncontrolled vomiting, signs of dehydration, severe mood changes, or any concerning symptoms. Early intervention improves outcomes."
  },
  {
    "id": 8,
    "week": 8,
    "trimester": 1,
    "phase": "Major organs form",
    "fetal_development": "All major organs are now formed - an incredible achievement in just 8 weeks. Your baby is constantly moving though too small to feel. Fingers and toes are webbed but distinct. The neural pathways that will control everything from breathing to thinking are establishing connections. This week marks the end of the embryonic period - risk of major malformations decreases significantly after this point.",
    "maternal_hormones": "Peak hormone levels for many women, placenta nearly ready to take over hormone production. This hormonal peak explains why weeks 6-10 are often the most symptomatic.",
    "paternal_changes": "Understanding this is often the worst symptom period helps maintain perspective. Symptoms typically improve after placenta takes over hormone production around week 10-12.",
    "medical_appointments": "First prenatal visit should be completed by now. Blood work results may be available. Discuss genetic screening options.",
    "baby_size_comparison": "a kidney bean",
    "baby_size_inches": 0.63,
    "baby_weight_grams": 1,
    "emotional_patterns": "Partner needs maximum support as symptoms peak. Fathers may feel overwhelmed by caregiving responsibilities while managing their own anxieties.",
    "anxiety_triggers": "First doctor visit concerns, interpreting test results, partner's intense symptoms creating helplessness, early pregnancy loss fears at peak.",
    "bonding_opportunities": "Learn baby is moving constantly even though movements aren't felt yet. Watch ultrasound videos online of 8-week embryos moving - it's remarkable.",
    "actionable_tasks": "Maximum support critical: anticipate needs, handle all strong smells, create comfortable rest spaces, manage appointments and paperwork, be symptom advocate with providers.",
    "common_questions": "Is this level of sickness normal? When will she feel better? What do test results mean? Should we do genetic testing?",
    "safety_considerations": "Ensure partner stays hydrated - offer fluids every hour. Small frequent meals prevent empty stomach. B6 and ginger shown effective for nausea.",
    "communication_focus": "Understanding peak symptom period - reassure partner that improvement is coming while validating current difficulties.",
    "did_you_know": "Baby graduates from embryo to fetus this week, having successfully formed all essential organs. The term 'fetus' means 'young one' in Latin, recognizing the human appearance now evident.",
    "maternal_symptoms_changes": "Morning sickness may peak, extreme fatigue, frequent urination increasing, breast changes continuing, possible constipation beginning from progesterone.",
    "risk_indicators": "Hyperemesis gravidarum if symptoms severe, concerning blood work results requiring follow-up.",
    "when_to_seek_medical_help": "If partner loses weight, shows dehydration signs, can't function daily, or has severe mood changes. Don't minimize symptoms - advocate for treatment."
  },
  {
    "id": 9,
    "week": 9,
    "trimester": 1,
    "phase": "Fetus stage begins",
    "fetal_development": "Now officially a fetus! All essential organs are present and beginning to function. Reproductive organs developing but not yet visible on ultrasound. Baby can now bend elbows and knees. Fingers and toes have separated. Taste buds forming on tongue. This week typically brings lower miscarriage risk - a relief milestone for many couples.",
    "maternal_hormones": "Hormones may begin stabilizing slightly as placenta assumes production. hCG levels plateau and may start declining, often bringing symptom improvement.",
    "paternal_changes": "Recognizing transition from embryo to fetus helps appreciate the remarkable development achieved. Major construction is complete; now it's about growth and refinement.",
    "medical_appointments": "Follow-up appointments may begin on regular schedule (typically every 4 weeks in first trimester).",
    "baby_size_comparison": "a grape",
    "baby_size_inches": 0.9,
    "baby_weight_grams": 2,
    "emotional_patterns": "Relief as major milestone reached and symptoms may improve. Cautious optimism growing as miscarriage risk decreases.",
    "anxiety_triggers": "Continuing worry about partner's wellbeing, interpreting symptom changes (is improvement normal?), deciding when to share news.",
    "bonding_opportunities": "Celebrate reaching fetus stage - maybe create small private ritual acknowledging this milestone. Document pregnancy journey with weekly photos.",
    "actionable_tasks": "Continue supportive care, watch for gradual symptom improvement, help partner gradually increase activity as energy returns, plan pregnancy announcement.",
    "common_questions": "What does it mean that it's a fetus now? Is she getting better? Can we tell people? When is it 'safe' to announce?",
    "safety_considerations": "Continue monitoring symptoms but may notice improvement. Encourage gentle activity as tolerated - movement helps with energy and mood.",
    "communication_focus": "Celebrating developmental milestones while respecting continued caution about sharing news until comfortable.",
    "did_you_know": "Baby's movements are reflex responses to nervous system development. These early movements help strengthen muscles and establish neural pathways essential for coordinated movement after birth.",
    "maternal_symptoms_changes": "Morning sickness may begin improving gradually, energy possibly increasing slightly, emotions may stabilize somewhat, breast tenderness continues.",
    "risk_indicators": "Watch for signs symptoms aren't improving as expected, which may need evaluation.",
    "when_to_seek_medical_help": "For persistent severe symptoms past week 10, concerning test results, or any new worrying symptoms."
  },
  {
    "id": 10,
    "week": 10,
    "trimester": 1,
    "phase": "Organ function begins",
    "fetal_development": "Vital organs start functioning - kidneys produce urine, liver makes blood cells, pancreas produces insulin. Bones and cartilage forming throughout body. If boy, testes begin producing testosterone. Brain connections increasing rapidly, creating foundation for all future learning and development. Fingernails beginning to grow.",
    "maternal_hormones": "Hormones stabilizing for many women as placenta takes over production. This transition explains why many women feel better entering second trimester.",
    "paternal_changes": "Supporting partner through symptom improvements while remaining attentive to ongoing needs. Energy may return gradually, not suddenly.",
    "medical_appointments": "Regular prenatal checkups establishing routine care pattern. May discuss upcoming genetic screening options.",
    "baby_size_comparison": "a kumquat",
    "baby_size_inches": 1.2,
    "baby_weight_grams": 4,
    "emotional_patterns": "Hope as symptoms may improve, excitement about approaching second trimester, considering sharing news with close family.",
    "anxiety_triggers": "Cautious optimism about improvement, decisions about genetic testing, workplace disclosure timing, family announcement planning.",
    "bonding_opportunities": "Partner may start showing slightly - first visible sign of pregnancy. Take first 'bump' photos even if barely visible - you'll treasure progression photos.",
    "actionable_tasks": "Help with maternity clothes shopping (comfort becomes important), continue household support, research genetic screening options together, plan family announcements.",
    "common_questions": "Is she really getting better? When can we tell people? What genetic tests should we do? Is that tiny bump the baby?",
    "safety_considerations": "Support transition to maternity clothing for comfort. Partner's regular clothes may feel tight even without visible bump. Bloating is normal.",
    "communication_focus": "Discussing announcement plans - who to tell first, how to share news, handling different reactions.",
    "did_you_know": "Vital organs functioning marks major milestone. Baby is now a tiny but complete human with all major systems operational, just needing time to grow and mature.",
    "maternal_symptoms_changes": "Morning sickness often improving, energy beginning to return, 'pregnancy glow' may start as blood volume increases, possible visible veins from increased circulation.",
    "risk_indicators": "Some women continue severe symptoms needing ongoing support and possibly medication.",
    "when_to_seek_medical_help": "For persistent severe symptoms, concerning genetic screening results, or questions about testing options."
  },
  {
    "id": 11,
    "week": 11,
    "trimester": 1,
    "phase": "Gender development",
    "fetal_development": "External genitalia developing though not yet distinguishable on ultrasound. Baby can open and close fists, stick out tongue, and make complex movements. Tooth buds for all 20 baby teeth are present. Bones hardening from cartilage. Brain structure becoming more complex with distinct regions visible.",
    "maternal_hormones": "Morning sickness often improving as hCG declines from peak. Energy increasing for many women. Hormones stabilizing at sustainable levels.",
    "paternal_changes": "Noticing partner's energy improvements brings relief. This is often when couples start enjoying pregnancy more as debilitating symptoms ease.",
    "medical_appointments": "Follow-up visits continue. May schedule nuchal translucency scan if genetic screening chosen (11-14 week window).",
    "baby_size_comparison": "a fig",
    "baby_size_inches": 1.6,
    "baby_weight_grams": 7,
    "emotional_patterns": "Energy improvements bring relief and renewed optimism. Relationship may improve as symptoms ease and normal life partially resumes.",
    "anxiety_triggers": "Decisions about sharing pregnancy news, genetic screening anxiety, workplace announcement timing, extended family dynamics.",
    "bonding_opportunities": "Partner may start showing - celebrate first visible sign of pregnancy. Practice talking/singing to baby - vocal cords are forming.",
    "actionable_tasks": "Help with maternity shopping, take weekly bump photos, research announcement ideas, support decision-making about genetic testing, plan second trimester activities.",
    "common_questions": "When should we tell our families? How do we announce at work? Should we find out the gender? What about genetic testing?",
    "safety_considerations": "Support partner's renewed activity carefully - energy returns gradually. Encourage continued prenatal vitamins and healthy habits as nausea improves.",
    "communication_focus": "Genetic screening decisions require thoughtful discussion about values, risk tolerance, and how you'd use information. No right or wrong choice.",
    "did_you_know": "Baby's taste buds are forming and will soon detect flavors from amniotic fluid, influenced by mother's diet. This early flavor exposure may influence food preferences after birth.",
    "maternal_symptoms_changes": "Morning sickness significantly improved for most, energy returning, mood stabilizing, small bump may be visible, breast tenderness decreasing.",
    "risk_indicators": "Small percentage continue severe symptoms. Watch for signs of depression as hormones adjust.",
    "when_to_seek_medical_help": "For genetic testing questions, persistent symptoms, or concerns about screening results. Also for announcement timing guidance."
  },
  {
    "id": 12,
    "week": 12,
    "trimester": 1,
    "phase": "Major milestone",
    "fetal_development": "End of first trimester - celebrate this major milestone! Risk of miscarriage drops to about 3-5%. All major organs present and functioning at basic level. Reflexes developing - baby will move away from pressure on mother's abdomen. Vocal cords formed. Sex organs clearly differentiated internally though may not be visible on ultrasound yet. Placenta fully functional.",
    "maternal_hormones": "Significant improvement in most women as placenta handles hormone production efficiently. Second trimester hormones promote energy and wellbeing.",
    "paternal_changes": "End of first trimester brings relief and excitement. Many couples feel comfortable sharing news more widely after this milestone.",
    "medical_appointments": "NT scan if genetic screening chosen. Results discussion may occur. Planning second trimester care schedule.",
    "baby_size_comparison": "a lime",
    "baby_size_inches": 2.1,
    "baby_weight_grams": 14,
    "emotional_patterns": "Relief about reduced miscarriage risk, excitement about sharing news publicly, renewed energy for pregnancy planning and preparation.",
    "anxiety_triggers": "Genetic screening results interpretation, public announcement pressure, managing others' reactions and advice, gender curiosity increasing.",
    "bonding_opportunities": "Preparation for sharing news widely - this is your pregnancy too, be involved in announcements. Create keepsake of first trimester.",
    "actionable_tasks": "Support pregnancy announcements, handle unwanted advice gracefully, research baby gear (but wait to buy), celebrate milestone appropriately.",
    "common_questions": "Should we do genetic testing? What are the risks now? How do we handle everyone's opinions? When can we know gender?",
    "safety_considerations": "Consider genetic testing decisions carefully - understand what you're testing for and how you'd use information. No right or wrong choice.",
    "communication_focus": "Planning announcements and handling reactions - everyone has opinions about pregnancy. Develop strategies for maintaining boundaries.",
    "did_you_know": "Risk of miscarriage drops dramatically after 12 weeks because placenta is established and major organ formation is complete. This explains the tradition of waiting to announce until second trimester.",
    "maternal_symptoms_changes": "Morning sickness typically resolved, energy returning significantly, appetite normalizing, emotional stability improving, possible round ligament pain beginning.",
    "risk_indicators": "Genetic screening abnormalities requiring follow-up, persistent first trimester symptoms unusual at this stage.",
    "when_to_seek_medical_help": "For genetic testing counseling, abnormal screening results, or persistent concerning symptoms. Also for reassurance about announcing pregnancy."
  },
  {
    "id": 13,
    "week": 13,
    "trimester": 1,
    "phase": "First trimester end",
    "fetal_development": "Welcome to the second trimester! Baby's intestines, which were partially in umbilical cord, move to proper position in abdomen. Vocal cords developing for eventual crying and cooing. Arms now proportional to body. Fingerprints beginning to form - your baby's unique identity developing. Movement patterns becoming more coordinated though still too small to feel.",
    "maternal_hormones": "Energy typically much improved. Libido may return as nausea resolves and energy increases. Hair may become thicker and shinier from hormones.",
    "paternal_changes": "Celebrating end of first trimester together. Many couples find relationship improves as symptoms ease and excitement builds.",
    "medical_appointments": "End of first trimester monitoring. Planning genetic screening if desired. Regular appointment schedule continues.",
    "baby_size_comparison": "a pea pod",
    "baby_size_inches": 2.9,
    "baby_weight_grams": 23,
    "emotional_patterns": "Excitement about sharing news publicly, relief from symptom improvement, renewed relationship connection possible, future planning enthusiasm.",
    "anxiety_triggers": "Managing public announcements, dealing with unsolicited advice, workplace adjustments, family boundary setting, information overload from others.",
    "bonding_opportunities": "Plan creative announcement if desired - involve father's perspective. Begin regular bump photos. Start pregnancy scrapbook or digital record.",
    "actionable_tasks": "Help plan announcements, manage social media sharing, research childbirth classes for later, support partner's increased activity level, enjoy improved energy together.",
    "common_questions": "How should we announce? What do we say at work? How do we handle intrusive questions? Is increased energy normal?",
    "safety_considerations": "Support gradual activity increase - partner may overdo it after weeks of fatigue. Encourage balanced approach to renewed energy.",
    "communication_focus": "Setting boundaries with family and friends - pregnancy makes everyone feel entitled to give advice and share opinions.",
    "did_you_know": "Baby can now make facial expressions including frowning and squinting. These movements help develop facial muscles needed for nursing and eventually showing emotions.",
    "maternal_symptoms_changes": "Morning sickness resolved for most, appetite returning, energy boost beginning, pregnancy glow developing, occasional headaches possible from increased blood volume.",
    "risk_indicators": "Late first trimester complications rare but watch for any concerning symptoms.",
    "when_to_seek_medical_help": "For any worrying symptoms, questions about public announcement, or workplace accommodation needs."
  },
  {
    "id": 14,
    "week": 14,
    "trimester": 2,
    "phase": "Second trimester begins",
    "fetal_development": "Second trimester brings rapid growth and exciting developments. Baby's neck strengthens, allowing head movement separate from body. Facial muscles developing - baby can squint, frown, and grimace. Red blood cells forming in spleen. Gender may be determinable on ultrasound soon. Fine hair (lanugo) beginning to grow for temperature regulation.",
    "maternal_hormones": "Energy surge common as hormones stabilize. Increased blood flow creates 'pregnancy glow.' Appetite returns with potential specific cravings.",
    "paternal_changes": "Increased involvement opportunities as partner feels better. This trimester often called 'honeymoon period' of pregnancy - enjoy it together.",
    "medical_appointments": "Regular appointments every 4 weeks typical. May discuss anatomy scan scheduling (18-22 weeks).",
    "baby_size_comparison": "a lemon",
    "baby_size_inches": 3.5,
    "baby_weight_grams": 45,
    "emotional_patterns": "Renewed energy and optimism, gender curiosity building, nursery planning excitement, increased bonding opportunities as pregnancy becomes public.",
    "anxiety_triggers": "Gender reveal decisions and family opinions, nursery planning overwhelming options, budgeting for baby expenses, maintaining relationship intimacy.",
    "bonding_opportunities": "Start talking to baby regularly - hearing development begins soon. Plan nursery together. Consider babymoon trip while travel comfortable.",
    "actionable_tasks": "Research pediatricians early (good ones book up), support nutritional needs as appetite returns, maintain exercise routine together, address intimacy openly.",
    "common_questions": "When can we find out gender? Should we find out? How do we start preparing nursery? Is travel safe?",
    "safety_considerations": "Support healthy weight gain as appetite returns - second trimester typically sees steady gain. Encourage continued prenatal vitamins.",
    "communication_focus": "Planning for baby while maintaining couple relationship - don't lose sight of partnership in pregnancy excitement.",
    "did_you_know": "Baby's gender can be determined by ultrasound as early as 14 weeks with experienced technician, though 18-20 week anatomy scan is more reliable. Gender is determined at conception but takes time to be externally visible.",
    "maternal_symptoms_changes": "Energy surge, appetite returning, reduced nausea, thicker hair, pregnancy glow from increased blood volume, possible nasal congestion from increased blood flow.",
    "risk_indicators": "Round ligament pain (sharp abdominal pains) normal but can be concerning if severe.",
    "when_to_seek_medical_help": "For severe abdominal pain, heavy bleeding, severe headaches, or signs of infection. Round ligament pain is common but severe pain needs evaluation."
  },
  {
    "id": 15,
    "week": 15,
    "trimester": 2,
    "phase": "Active movement phase",
    "fetal_development": "Baby incredibly active - doing full flips and rolls in spacious amniotic sac. Legs now longer than arms, achieving normal proportions. Scalp hair pattern forming based on genetics. All joints working - elbows, knees, wrists, ankles. Practice breathing movements beginning though lungs contain fluid. Can sense light through closed eyelids.",
    "maternal_hormones": "Sexual desire often increases as energy returns and nausea resolves. Vaginal discharge increases (normal protection mechanism). Joint flexibility increasing from relaxin.",
    "paternal_changes": "Support partner's changing body image and potential increased intimacy needs. This can be wonderful bonding time for couples.",
    "medical_appointments": "Continue regular monitoring. Genetic screening results discussion if testing performed.",
    "baby_size_comparison": "an apple",
    "baby_size_inches": 4,
    "baby_weight_grams": 70,
    "emotional_patterns": "Increased connection as pregnancy becomes more real, potential intimacy improvements, future planning excitement, gender curiosity peak.",
    "anxiety_triggers": "Balancing increased intimacy with body changes, planning overwhelming decisions, managing extended family involvement, financial reality setting in.",
    "bonding_opportunities": "Talk and sing to baby - auditory system developing rapidly. Plan intimate time together while comfortable. Research baby gear systematically.",
    "actionable_tasks": "Research baby care classes for third trimester, support dietary changes as appetite increases, plan romantic gestures, start baby registry basics.",
    "common_questions": "Is all this movement normal? Should we feel it yet? What about sex during pregnancy? What gear is essential?",
    "safety_considerations": "Sex generally safe throughout pregnancy unless complications exist. Increased discharge normal - watch for unusual color/odor indicating infection.",
    "communication_focus": "Maintaining intimacy while navigating body changes - communication essential for both partners' needs.",
    "did_you_know": "Baby's movement is like an astronaut in zero gravity - the amniotic fluid provides perfect suspension for acrobatic practice. These movements develop muscle strength and coordination.",
    "maternal_symptoms_changes": "Increased energy and libido possible, growing belly becoming noticeable, possible heartburn beginning, skin changes including darkening nipples and linea nigra.",
    "risk_indicators": "Persistent digestive issues may need dietary modification. Watch for urinary symptoms indicating infection.",
    "when_to_seek_medical_help": "For severe heartburn affecting nutrition, signs of urinary tract infection, unusual discharge, or concerns about sexual activity."
  },
  {
    "id": 16,
    "week": 16,
    "trimester": 2,
    "phase": "Sensory development",
    "fetal_development": "Major milestone: Baby's eyes making slow side-to-side movements despite closed lids. Ears nearly in final position. Can hear cardiovascular sounds - mother's heartbeat, blood flow, digestive sounds. Fingernails growing. If girl, eggs forming in ovaries. Coordinated arm and leg movements developing. May begin thumb sucking.",
    "maternal_hormones": "Back pain may begin from weight shift and posture changes. Pregnancy glow peak from increased blood volume. Possible skin changes including darkening.",
    "paternal_changes": "Prepare for gender reveal if desired at upcoming anatomy scan. Support partner's changing body mechanics as center of gravity shifts.",
    "medical_appointments": "Routine prenatal visits. Schedule anatomy scan for 18-22 week window. Discuss any concerns about symptoms.",
    "baby_size_comparison": "an avocado",
    "baby_size_inches": 4.5,
    "baby_weight_grams": 100,
    "emotional_patterns": "Anticipation building for anatomy scan, concrete preparation plans forming, gender reveal excitement if choosing to learn, deepening awareness of baby's development.",
    "anxiety_triggers": "Gender reveal pressure from family/friends, anatomy scan anxiety about abnormalities, physical discomfort management, work-life balance with appointments.",
    "bonding_opportunities": "Start talking to baby regularly - they're beginning to hear your voice. Research birthing options and hospitals. Plan gender reveal if desired.",
    "actionable_tasks": "Research birthing classes, practice good posture to prevent back pain, help with maternity clothes shopping, prepare questions for anatomy scan.",
    "common_questions": "Should we find out gender? What happens at anatomy scan? How do we prepare? What if something's wrong?",
    "safety_considerations": "Encourage good posture and prenatal yoga for back pain. Lifting technique important as ligaments loosen. Support devices may help.",
    "communication_focus": "Discussing birth preferences early allows time for research and alignment between partners.",
    "did_you_know": "Baby's ears can now detect sounds, starting with internal sounds like heartbeat. By birth, baby will recognize parents' voices from months of listening in utero.",
    "maternal_symptoms_changes": "Back pain from posture changes, visible bump for most, skin changes including possible darkening, breast growth continuing, energy generally good.",
    "risk_indicators": "Severe back pain may indicate problems. Monitor for preterm labor signs though rare at this stage.",
    "when_to_seek_medical_help": "For persistent severe back pain, signs of preterm labor (regular contractions, pelvic pressure), or any concerning symptoms."
  },
  {
    "id": 17,
    "week": 17,
    "trimester": 2,
    "phase": "Protective coating develops",
    "fetal_development": "Vernix caseosa (creamy protective coating) beginning to form on skin - like waterproof barrier protecting baby from constant fluid exposure. Skeleton changing from soft cartilage to bone. Brown fat deposits forming for temperature regulation after birth. Hearing improving - loud noises may cause startle response. Unique fingerprints nearly complete.",
    "maternal_hormones": "Skin stretching sensations as uterus expands. Increased vaginal discharge and other bodily fluids. Possible nasal congestion from increased blood flow.",
    "paternal_changes": "Begin birth plan discussions - early planning reduces stress later. Support partner's comfort as body changes accelerate.",
    "medical_appointments": "Continue regular appointments. Anatomy scan approaching. May offer additional screening tests.",
    "baby_size_comparison": "a turnip",
    "baby_size_inches": 5.1,
    "baby_weight_grams": 140,
    "emotional_patterns": "Growing excitement about visible pregnancy, increased public acknowledgment bringing reality, birth planning beginning, partnership deepening through shared planning.",
    "anxiety_triggers": "Information overload about birth options, conflicting advice from others, body image adjustments, maintaining professional life while visibly pregnant.",
    "bonding_opportunities": "Discuss birth preferences together - hospital vs birth center, pain management options, support people. Start researching childcare for return to work.",
    "actionable_tasks": "Help with daily moisturizing routine for stretching skin, research birth options together, manage information overload, support comfort needs.",
    "common_questions": "What kind of birth do we want? Should we hire a doula? What about cord blood banking? How do we choose pediatrician?",
    "safety_considerations": "Daily moisturizing may help skin comfort though stretch marks are largely genetic. Hydration important for skin elasticity.",
    "communication_focus": "Beginning birth planning conversations - approach as team decisions requiring research and discussion.",
    "did_you_know": "Baby developing unique fingerprints through interaction between genetic programming and random forces in amniotic fluid - truly one-of-a-kind identity forming.",
    "maternal_symptoms_changes": "Skin stretching sensations, increased discharge normal, nasal congestion common, energy good but starting to feel pregnancy weight, possible leg cramps beginning.",
    "risk_indicators": "Watch for signs of preeclampsia as pregnancy progresses - sudden swelling, severe headaches, vision changes.",
    "when_to_seek_medical_help": "For severe headaches, sudden swelling especially face/hands, vision changes, severe abdominal pain, or decreased fetal movement."
  },
  {
    "id": 18,
    "week": 18,
    "trimester": 2,
    "phase": "Hearing develops",
    "fetal_development": "Baby can now clearly hear sounds from outside the womb - your voice carries through tissue and fluid differently than external sounds, making parents' voices special and recognizable. Sleep-wake cycles establishing. If boy, prostate developing. Myelin (nerve insulation) beginning to form, speeding nerve signal transmission. Digestive system practicing by swallowing amniotic fluid.",
    "maternal_hormones": "Side sleeping becomes necessary as uterus weight can compress major blood vessels when lying on back. First sensations of fetal movement possible (quickening).",
    "paternal_changes": "Excitement of potentially feeling first movements. Schedule anatomy scan - major milestone for visualizing baby's development and health.",
    "medical_appointments": "Mid-pregnancy anatomy scan typically scheduled this week or next. Comprehensive evaluation of fetal development.",
    "baby_size_comparison": "a bell pepper",
    "baby_size_inches": 5.6,
    "baby_weight_grams": 190,
    "emotional_patterns": "Anatomy scan anticipation/anxiety, potentially feeling first movements brings new connection level, gender discovery excitement if choosing, concrete planning phase.",
    "anxiety_triggers": "Anatomy scan worry about findings, interpreting movement sensations, managing others' gender expectations, balancing preparation with superstition.",
    "bonding_opportunities": "Feel for movements together - partner's hand on belly during quiet times. Attend anatomy scan together if possible. Start reading to baby.",
    "actionable_tasks": "Prepare anatomy scan questions, plan gender reveal if finding out, consider prenatal massage for partner, start clearing nursery space.",
    "common_questions": "What will anatomy scan show? Is everything developing normally? Why haven't I felt movement yet? Should we worry?",
    "safety_considerations": "First movements feel like flutters, bubbles, or light taps - easy to miss or confuse with digestion. More noticeable when lying quietly.",
    "communication_focus": "Anatomy scan preparation - understanding this detailed evaluation checks organ development, growth, placenta position, and amniotic fluid.",
    "did_you_know": "Baby can now hear your voice and responds to it. Studies show newborns prefer sounds they heard frequently in utero, especially parents' voices and music.",
    "maternal_symptoms_changes": "Sleep position restrictions beginning, may start feeling movements (especially if not first pregnancy), anatomy scan excitement/anxiety, continued energy and appetite.",
    "risk_indicators": "Anatomy scan may reveal complications requiring monitoring or intervention. Placenta position important to note.",
    "when_to_seek_medical_help": "For anatomy scan abnormalities, lack of fetal movement by 22 weeks in first pregnancy, severe headaches, or concerning symptoms."
  },
  {
    "id": 19,
    "week": 19,
    "trimester": 2,
    "phase": "Protective skin develops",
    "fetal_development": "Vernix caseosa now fully coating baby's skin like thick moisturizer, protecting from constant fluid exposure and providing antibacterial properties. If girl, vagina, uterus, and fallopian tubes formed. Permanent teeth forming behind baby teeth. More coordinated movements developing. Hair growing on scalp based on genetic programming.",
    "maternal_hormones": "Definite bump visible to others. Breast changes continuing in preparation for feeding. Some women experience Braxton Hicks practice contractions.",
    "paternal_changes": "Visible pregnancy brings public acknowledgment and unsolicited advice. Support partner in handling intrusive comments and maintaining boundaries.",
    "medical_appointments": "Regular monitoring continues. Anatomy scan if not completed. Results discussion and follow-up planning if needed.",
    "baby_size_comparison": "a mango",
    "baby_size_inches": 6,
    "baby_weight_grams": 240,
    "emotional_patterns": "Visible pregnancy making it 'real' for others, potentially regular movement sensations, nursery planning concrete, public identity shift to expecting parents.",
    "anxiety_triggers": "Movement anxiety if not felt yet, managing public pregnancy attention, information overload from well-meaning advice, body image adjustments.",
    "bonding_opportunities": "Bond through movement - spend quiet time feeling for kicks together. Begin nursery planning in earnest. Research newborn care basics.",
    "actionable_tasks": "Start nursery preparation, sign up for birth and baby care classes, continue regular exercise together, practice newborn care skills.",
    "common_questions": "Are movement patterns normal? Why do people feel entitled to touch her belly? What classes do we need? How do we prepare?",
    "safety_considerations": "Movement patterns vary greatly - anterior placenta can muffle sensations. By 22-24 weeks, most feel regular movement. Trust partner's instincts.",
    "communication_focus": "Handling public pregnancy attention - setting boundaries about belly touching and intrusive questions while remaining gracious.",
    "did_you_know": "Baby releases up to half a liter of urine daily into amniotic fluid, which is swallowed and processed again - nature's perfect recycling system for practice organ function.",
    "maternal_symptoms_changes": "Definite visible bump, possible Braxton Hicks contractions, increased appetite, skin changes continuing, balance starting to shift, energy remaining good.",
    "risk_indicators": "Decreased fetal movement patterns once established. Anterior placenta may explain delayed movement sensation.",
    "when_to_seek_medical_help": "For absent fetal movement by 22 weeks, significant change in established movement pattern, or severe abdominal pain."
  },
  {
    "id": 20,
    "week": 20,
    "trimester": 2,
    "phase": "Halfway milestone",
    "fetal_development": "Congratulations - you're halfway there! Fundal height (top of uterus) now at belly button level. Baby covered in lanugo (fine hair) for warmth and vernix for protection. Taste buds fully functional - baby tastes what mom eats through amniotic fluid. If boy, testicles beginning descent from abdomen. Sleep cycles more regular with favorite positions emerging.",
    "maternal_hormones": "Fundal height measurements begin at appointments. Energy typically good though some fatigue from carrying extra weight. Appetite strong with possible specific cravings.",
    "paternal_changes": "Celebrate halfway milestone together. This is achievement worth acknowledging - you've successfully navigated half of pregnancy journey.",
    "medical_appointments": "Fundal height measurements start. Regular appointments continue. May discuss glucose screening for weeks 24-28.",
    "baby_size_comparison": "a banana",
    "baby_size_inches": 6.5,
    "baby_weight_grams": 300,
    "emotional_patterns": "Halfway celebration bringing confidence, established movement patterns deepening connection, future planning excitement, increased public recognition as expecting parents.",
    "anxiety_triggers": "Preparation task overwhelm at halfway point, managing others' birth story sharing, body changes accelerating, maintaining relationship focus amid baby preparation.",
    "bonding_opportunities": "Celebrate milestone with special date or babymoon planning. Document journey with photos/video. Feel movements together regularly. Plan something special for partner.",
    "actionable_tasks": "Mark halfway point meaningfully, research cord blood banking decision, start registry if desired, plan babymoon for second trimester energy.",
    "common_questions": "We're halfway - what needs to be done? Should we travel? What's most important to prepare? How is she feeling emotionally?",
    "safety_considerations": "Fundal height helps track growth - should roughly equal weeks pregnant in centimeters. Variations normal but consistent tracking important.",
    "communication_focus": "Celebrating milestones maintains positive pregnancy experience - acknowledge achievements and progress together.",
    "did_you_know": "Baby can now taste what mother eats - spicy foods, garlic, and strong flavors pass through amniotic fluid. This early exposure may influence food preferences after birth.",
    "maternal_symptoms_changes": "Fundal height at navel, definite movement patterns, good energy but increasing fatigue, back discomfort possible, excellent appetite, mood generally positive.",
    "risk_indicators": "Fundal height significantly off from expected (could indicate growth issues or fluid problems).",
    "when_to_seek_medical_help": "For fundal height concerns, absent or significantly changed fetal movement, or any worrying symptoms at halfway point."
  },
  {
    "id": 21,
    "week": 21,
    "trimester": 2,
    "phase": "Reflexes develop",
    "fetal_development": "Major milestone: sucking reflex developing for future feeding. Baby's movements more coordinated and purposeful rather than random. Bone marrow beginning blood cell production. Eyebrows and eyelids fully formed. Female babies have fully formed uterus and vagina. Rapid eye movement (REM) sleep beginning - possibly dreaming!",
    "maternal_hormones": "Braxton Hicks contractions may begin - painless practice contractions preparing uterus for labor. Leg cramps common especially at night. Stretch marks may appear.",
    "paternal_changes": "Learn to distinguish Braxton Hicks from real contractions. Understanding these practice contractions reduces anxiety later in pregnancy.",
    "medical_appointments": "Regular prenatal visits. Discussion of upcoming glucose screening. Monitor for signs of complications.",
    "baby_size_comparison": "a carrot",
    "baby_size_inches": 10.5,
    "baby_weight_grams": 360,
    "emotional_patterns": "Movement patterns bringing joy and connection, body changes requiring adaptation, future preparation accelerating, relationship dynamics shifting with physical changes.",
    "anxiety_triggers": "Practice contractions causing worry, body image concerns with stretch marks, sleep disruption from leg cramps, sexual adjustment needs.",
    "bonding_opportunities": "Learn about Braxton Hicks together - understanding reduces worry. Maintain intimacy creatively as body changes. Massage helps with leg cramps.",
    "actionable_tasks": "Research pain management options for birth, help with leg cramp relief (magnesium may help), maintain date nights, address intimacy changes openly.",
    "common_questions": "What are these contractions? Is this labor? Why the leg cramps? How do we maintain intimacy? Are stretch marks preventable?",
    "safety_considerations": "Braxton Hicks are irregular, painless tightening that stops with position change or hydration. Real labor contractions are regular, painful, and progressive.",
    "communication_focus": "Understanding body changes together - stretch marks are largely genetic but moisturizing helps comfort. Focus on amazing work body is doing.",
    "did_you_know": "Baby's digestive system practices by swallowing up to 17 ounces of amniotic fluid daily. This helps develop swallowing coordination and provides nutrients while stimulating digestive enzyme production.",
    "maternal_symptoms_changes": "Braxton Hicks beginning, leg cramps especially at night, possible stretch marks appearing, breast changes continuing, balance shifts increasing, heartburn possible.",
    "risk_indicators": "Preterm labor signs: regular painful contractions, pelvic pressure, back pain, fluid leakage, bleeding.",
    "when_to_seek_medical_help": "For regular painful contractions before 37 weeks, fluid leakage, bleeding, severe abdominal pain, or decreased fetal movement."
  },
  {
    "id": 22,
    "week": 22,
    "trimester": 2,
    "phase": "Gender fully visible",
    "fetal_development": "Baby's reproductive system now fully visible on ultrasound if positioned cooperatively. Fingernails nearly reaching fingertips. Hair and eyebrows visible. Inner ear fully developed - baby responding to voices and music. Pancreas developing steadily for future blood sugar regulation. Proportions now similar to newborn, just smaller.",
    "maternal_hormones": "Belly button may flatten or pop out from uterine pressure. Breathing may feel slightly restricted as uterus pushes upward. Increased blood flow may cause bleeding gums.",
    "paternal_changes": "Visible pregnancy milestones like belly button changes are normal. Focus on comfort and maintaining good oral hygiene as gums become sensitive.",
    "medical_appointments": "Continue regular monitoring. Plan glucose screening for coming weeks. Discuss any breathing concerns.",
    "baby_size_comparison": "a papaya",
    "baby_size_inches": 11,
    "baby_weight_grams": 430,
    "emotional_patterns": "Excitement about clearly visible pregnancy, potential gender knowledge bringing concrete planning, increased public recognition, deepening partner bonding through movement.",
    "anxiety_triggers": "Breathing discomfort worries, body changes accelerating, sleep position limitations, maintaining fitness with restrictions, dental health concerns.",
    "bonding_opportunities": "Plan maternity photos while energy good. Increase date nights before third trimester fatigue. Research baby gear together - overwhelming but necessary.",
    "actionable_tasks": "Schedule dental cleaning (important during pregnancy), research major baby gear purchases, plan maternity photos, maintain exercise routine modified for pregnancy.",
    "common_questions": "How much gear do we really need? What's essential vs nice-to-have? Why breathing problems? Should we worry about teeth?",
    "safety_considerations": "Bleeding gums common from increased blood flow - maintain excellent dental hygiene. Untreated dental issues can affect pregnancy outcomes.",
    "communication_focus": "Preparing practically while avoiding overconsumption - focus on essential items first, add conveniences later based on actual needs.",
    "did_you_know": "Baby now has complete miniature fingernails and toenails. If born now (though far too early), these tiny details show how complete development has become even at this stage.",
    "maternal_symptoms_changes": "Belly button changes, mild breathing restriction, bleeding gums common, continued breast growth, good energy but increasing physical challenges, movement patterns strong.",
    "risk_indicators": "Severe breathing difficulties, signs of preeclampsia developing, preterm labor signs, dental infections.",
    "when_to_seek_medical_help": "For severe breathing problems, chest pain, signs of preeclampsia (severe headaches, vision changes, sudden swelling), or dental emergencies."
  },
  {
    "id": 23,
    "week": 23,
    "trimester": 2,
    "phase": "Viability milestone",
    "fetal_development": "Critical milestone: baby reaching viability threshold - could survive outside womb with intensive medical support. Lungs beginning surfactant production - the substance preventing lung collapse. However, amounts remain far below needs for easy breathing. Every additional day significantly improves outcomes. Hearing fully developed - recognizes familiar voices and sounds.",
    "maternal_hormones": "Sensitive gums and potential nosebleeds from increased blood volume. Baby's sleep schedule may differ from mother's, causing nighttime activity. Colostrum may begin forming.",
    "paternal_changes": "Understanding viability helps appreciate each week's importance. While survival possible, every extra week dramatically improves outcomes and reduces complications.",
    "medical_appointments": "Financial and insurance planning important. Review coverage for potential NICU stay. Glucose screening approaching.",
    "baby_size_comparison": "a grapefruit",
    "baby_size_inches": 11.4,
    "baby_weight_grams": 500,
    "emotional_patterns": "Viability milestone brings relief and anxiety, future planning urgency increases, physical changes accelerating, relationship dynamics evolving with approaching parenthood.",
    "anxiety_triggers": "Financial planning stress with potential complications considered, viability awareness creating anxiety, sleep disruption from baby's schedule, body changes affecting self-image.",
    "bonding_opportunities": "Celebrate viability milestone while understanding continued development importance. Review finances and insurance together. Support sleep needs creatively.",
    "actionable_tasks": "Review insurance coverage including NICU possibilities, accelerate financial planning, create comfortable sleep environment, discuss parental leave plans.",
    "common_questions": "What if baby comes early? Are we financially prepared? Why is baby active when she tries to sleep? What about work leave?",
    "safety_considerations": "Baby's 20-40 minute sleep cycles don't match adult patterns. Most active times often when mother is still - her movement rocks baby to sleep during day.",
    "communication_focus": "Financial preparedness brings peace of mind - understanding insurance, planning for leave, and emergency fund reduce stress significantly.",
    "did_you_know": "At 23 weeks, baby has 10-30% survival chance with intensive care, but 90%+ chance of significant complications. Each additional week improves these statistics dramatically, showing why every day matters.",
    "maternal_symptoms_changes": "Bleeding gums and nosebleeds possible, baby's different sleep schedule noticeable, colostrum production possible, continued weight gain, increasing pelvic pressure.",
    "risk_indicators": "Preterm labor signs critical to recognize, gestational diabetes screening important, severe headaches or vision changes.",
    "when_to_seek_medical_help": "For signs of preterm labor (regular contractions, pelvic pressure, back pain, fluid leakage), severe headaches, vision changes, or bleeding."
  },
  {
    "id": 24,
    "week": 24,
    "trimester": 2,
    "phase": "Hearing enhancement",
    "fetal_development": "Baby's hearing so developed they respond to familiar voices with movement and heart rate changes. In NICU, 24-weekers often calm to recordings of parents' voices. Lungs developing air sacs (alveoli) and blood vessels. Skin still translucent but beginning to become opaque. Nostrils beginning to open. Major viability improvement - survival chances now around 60-70%.",
    "maternal_hormones": "Glucose screening test this week for most women. Uterus now extends well above navel. Possible carpal tunnel symptoms from fluid retention. Stronger fetal movements felt.",
    "paternal_changes": "Support during glucose screening - test can be unpleasant but screens for gestational diabetes affecting 10% of pregnancies. Understanding helps compliance.",
    "medical_appointments": "Glucose screening test typically performed. Results within days. If elevated, follow-up 3-hour test scheduled.",
    "baby_size_comparison": "an ear of corn",
    "baby_size_inches": 12,
    "baby_weight_grams": 600,
    "emotional_patterns": "Stronger movements creating powerful bonding moments, glucose test anxiety, viability improvements bringing relief, concrete preparation urgency, deepening father involvement.",
    "anxiety_triggers": "Glucose test worry and results anxiety, stronger movements sometimes painful, sleep disruption increasing, body changes accelerating, work-life balance challenging.",
    "bonding_opportunities": "Feel baby's stronger movements together daily. Support glucose testing process. Continue talking/singing - baby knows your voice. Research pediatricians seriously.",
    "actionable_tasks": "Accompany to glucose test if possible, prepare questions for pediatrician interviews, help track fetal movement patterns, plan nursery essentials.",
    "common_questions": "What does glucose test check? Is gestational diabetes serious? Why such strong kicks? How do we choose pediatrician?",
    "safety_considerations": "Gestational diabetes affects how body processes sugar, potentially causing large baby and complications. Usually manageable with diet modifications, monitoring.",
    "communication_focus": "Choosing pediatrician before birth allows relationship building and immediate care. Interview several to find good fit for parenting philosophy.",
    "did_you_know": "Baby's unique hearing ability: your voice travels through tissue and bone, creating special resonance baby will recognize after birth. Partners' voices heard regularly in utero are recognized and preferred by newborns.",
    "maternal_symptoms_changes": "Glucose screening scheduled, stronger more defined movements, possible swelling in hands/feet, carpal tunnel symptoms possible, continued breast changes.",
    "risk_indicators": "Gestational diabetes requiring management, preeclampsia signs developing, preterm labor risk continues.",
    "when_to_seek_medical_help": "For abnormal glucose results requiring follow-up, signs of preeclampsia, decreased fetal movement, or preterm labor symptoms."
  },
  {
    "id": 25,
    "week": 25,
    "trimester": 2,
    "phase": "Voice recognition",
    "fetal_development": "Remarkable development: baby now recognizes and responds specifically to parents' voices. Brain development includes pain perception and sensory processing. Spending significant time in REM sleep - possibly dreaming about sensations experienced. Capillaries forming under skin, creating less translucent appearance. Coordination improving with purposeful movements like bringing hands to face.",
    "maternal_hormones": "Frequent urination returns as growing uterus pressures bladder. Constipation and hemorrhoids possible from progesterone and pressure. Sciatic nerve pain may begin.",
    "paternal_changes": "Understanding baby recognizes your voice encourages continued talking and bonding. This recognition persists after birth, making your voice uniquely comforting.",
    "medical_appointments": "Regular prenatal appointments. Glucose test results discussion. Planning third trimester increased monitoring.",
    "baby_size_comparison": "a rutabaga",
    "baby_size_inches": 13.6,
    "baby_weight_grams": 660,
    "emotional_patterns": "Voice recognition deepening emotional connection, approaching third trimester creating urgency, physical discomforts increasing, bonding through interaction strengthening.",
    "anxiety_triggers": "Physical discomfort management, hemorrhoid embarrassment, birth plan decision pressure, managing work with increasing symptoms, relationship strain from discomforts.",
    "bonding_opportunities": "Talk and sing regularly - baby recognizes and prefers your voice! Begin detailed birth plan discussions. Support comfort measures for hemorrhoids/constipation.",
    "actionable_tasks": "Create regular talking/singing routine, help with hemorrhoid treatments, increase fiber in diet, research birth plan options thoroughly together.",
    "common_questions": "Does baby really know my voice? How do we write birth plan? Are hemorrhoids normal? What helps constipation?",
    "safety_considerations": "Baby's hearing so developed that newborns turn toward familiar voices and show preference for songs/stories heard in utero. Your voice matters.",
    "communication_focus": "Birth plan creation together - discuss preferences while understanding flexibility needed. Focus on preferences rather than rigid requirements.",
    "did_you_know": "Studies show babies in utero can differentiate between languages, recognize specific music, and show preference for stories read repeatedly during pregnancy - active learning is already happening.",
    "maternal_symptoms_changes": "Frequent urination returning, constipation common, hemorrhoids possible, sciatic nerve pain beginning, continued steady weight gain, movement patterns well established.",
    "risk_indicators": "Severe constipation risking complications, bleeding hemorrhoids, signs of urinary tract infection from pressure.",
    "when_to_seek_medical_help": "For severe constipation unrelieved by diet changes, bleeding hemorrhoids, signs of UTI, or severe sciatic pain affecting mobility."
  },
  {
    "id": 26,
    "week": 26,
    "trimester": 2,
    "phase": "Immune system building",
    "fetal_development": "Baby's immune system developing - receiving antibodies through placenta that provide protection for first months after birth. Eyes developed enough to open and close, sensing light changes. Lungs continuing crucial development but still need 8+ more weeks for adequate function. Brain wave activity increasingly complex. If boy, testicles beginning descent toward scrotum.",
    "maternal_hormones": "'Pregnancy brain' - forgetfulness from hormones and sleep deprivation. Blood pressure may fluctuate - important monitoring period. Restless sleep common from discomfort and active baby.",
    "paternal_changes": "'Pregnancy brain' is real - hormones and sleep deprivation affect memory and concentration. Patience and humor help cope with frustrating forgetfulness.",
    "medical_appointments": "Blood pressure monitoring important as preeclampsia risk period approaching. Regular appointments continue.",
    "baby_size_comparison": "an acorn squash",
    "baby_size_inches": 14,
    "baby_weight_grams": 760,
    "emotional_patterns": "Baby responding to light and sound creating interactive moments, approaching third trimester milestone, preparation tasks mounting, physical challenges increasing daily.",
    "anxiety_triggers": "Memory problems affecting work performance, sleep disruption frustration, blood pressure worries, approaching third trimester anxiety, body changes continuing dramatically.",
    "bonding_opportunities": "Use lists and reminders to combat forgetfulness. Monitor blood pressure at home if recommended. Encourage light exercise for mood and health.",
    "actionable_tasks": "Help track appointments and tasks, create organization systems, support exercise routine, monitor for concerning symptoms, prepare for third trimester.",
    "common_questions": "Why so forgetful? Is blood pressure concerning? What's normal discomfort vs problems? How do we prepare for third trimester?",
    "safety_considerations": "Light exercise like swimming or prenatal yoga helps with discomfort, blood pressure, and mood. Even 20 minutes daily makes significant difference.",
    "communication_focus": "Supporting each other through challenges - pregnancy brain affects both partners differently. Teamwork and humor essential.",
    "did_you_know": "Baby's eyes can now detect light through the womb - bright light causes pupil constriction and movement. This light sensitivity helps establish circadian rhythms before birth.",
    "maternal_symptoms_changes": "Pregnancy brain/forgetfulness, restless sleep, possible blood pressure changes, back pain increasing, movement very noticeable, breathing slightly restricted.",
    "risk_indicators": "High blood pressure readings, severe swelling, severe headaches, vision changes indicating preeclampsia development.",
    "when_to_seek_medical_help": "For blood pressure concerns, severe headaches, vision changes, sudden swelling, decreased fetal movement, or signs of preterm labor."
  },
  {
    "id": 27,
    "week": 27,
    "trimester": 2,
    "phase": "Second trimester end",
    "fetal_development": "Congratulations on completing second trimester! Baby's nervous system matured enough to control some body functions. Adding about half a pound weekly now. Can open and close eyes, sensing light/dark cycles. Developing sleep patterns you might notice. Thumb sucking common. If born now, survival chances exceed 90% with NICU care.",
    "maternal_hormones": "Multiple symptoms as body supports significant growth. Leg cramps, heartburn, shortness of breath common. Colostrum production may increase. Energy decreasing as third trimester approaches.",
    "paternal_changes": "Two-thirds milestone achievement - acknowledge progress while preparing for final trimester challenges. Major decisions should be finalized soon.",
    "medical_appointments": "End of second trimester assessment. Planning third trimester care including increased monitoring frequency.",
    "baby_size_comparison": "a cauliflower",
    "baby_size_inches": 14.4,
    "baby_weight_grams": 875,
    "emotional_patterns": "Completing two-thirds brings satisfaction and anticipation, third trimester preparation anxiety, physical challenges mounting, eager for pregnancy completion beginning.",
    "anxiety_triggers": "Third trimester preparation overwhelming, physical discomforts accumulating, sleep quality deteriorating, work decisions pressing, relationship adjustments needed.",
    "bonding_opportunities": "Complete major preparations now while energy remains. Interview pediatricians, finalize childcare plans, complete nursery basics. Rest becomes priority.",
    "actionable_tasks": "Finalize pediatrician choice, arrange childcare for return to work, complete major purchases, plan parental leave details, increase household help.",
    "common_questions": "Are we ready for third trimester? What must be done now? Why so many symptoms? How do we manage everything?",
    "safety_considerations": "Completing major decisions now reduces third trimester stress when energy and mobility decrease. Prioritize essential tasks only.",
    "communication_focus": "Preparing for final trimester together - acknowledge physical challenges while maintaining emotional connection and excitement.",
    "did_you_know": "Baby's brain developing unique patterns - the grooves and indentations (gyri and sulci) that create the characteristic appearance of human brain and vastly increase surface area for neural connections.",
    "maternal_symptoms_changes": "Leg cramps frequent, heartburn increasing, mild breathlessness, hemorrhoids possible, Braxton Hicks more noticeable, fatigue returning, movement patterns strong.",
    "risk_indicators": "Preterm labor signs, severe swelling or headaches, decreased fetal movement from established patterns.",
    "when_to_seek_medical_help": "For signs of preterm labor, preeclampsia symptoms, or any concerns about entering third trimester. Also for work accommodation needs."
  },
  {
    "id": 28,
    "week": 28,
    "trimester": 3,
    "phase": "Third trimester begins",
    "fetal_development": "Welcome to third trimester - the home stretch! Baby's eyes can focus, blinking regularly. Brain developing billions of neurons. Dreaming likely occurring during REM sleep. Major milestone: can regulate own body temperature. Survival rate if born now exceeds 95%, though lung support still needed. Adding layers of fat for newborn temperature regulation.",
    "maternal_hormones": "Third trimester exhaustion beginning. Appointment frequency increases to every 2 weeks. Shortness of breath as uterus crowds lungs. Vivid dreams common.",
    "paternal_changes": "Begin kick counting routine - tracking baby's movement patterns helps identify potential problems early. This active monitoring makes fathers valuable safety partners.",
    "medical_appointments": "Every 2 weeks appointments begin. RhoGAM injection if Rh-negative. Kick count education provided.",
    "baby_size_comparison": "a large eggplant",
    "baby_size_inches": 14.8,
    "baby_weight_grams": 1000,
    "emotional_patterns": "Third trimester reality bringing mixed emotions, kick counting responsibility, increasing preparation urgency, physical sympathy for partner's discomfort, anticipation building.",
    "anxiety_triggers": "Kick counting anxiety about doing it right, physical demands on partner concerning, work/preparation balance difficult, sleep disruption affecting both partners.",
    "bonding_opportunities": "Start daily kick counts together - aim for 10 movements in 2 hours. Learn baby's patterns. Support comfort measures as symptoms increase.",
    "actionable_tasks": "Establish kick counting routine, help create comfortable resting positions, take over more household duties, prepare for increased appointments.",
    "common_questions": "How do we count kicks properly? What if movement decreases? Why so tired again? Is this discomfort normal?",
    "safety_considerations": "Kick counts: 10 movements in 2 hours is reassuring. Time when baby usually active. Decreased movement needs immediate evaluation - don't wait.",
    "communication_focus": "Understanding kick counts as safety tool - you're actively monitoring baby's wellbeing. Trust instincts about concerning changes.",
    "did_you_know": "Baby's brain developing sophisticated functions - the visual cortex can process light information, auditory cortex recognizes familiar sounds, and memory centers are forming lasting neural pathways.",
    "maternal_symptoms_changes": "Third trimester fatigue, shortness of breath, vivid dreams, increased Braxton Hicks, back pain worsening, frequent urination intense, movement patterns very noticeable.",
    "risk_indicators": "Decreased fetal movement, signs of preterm labor, preeclampsia symptoms becoming more common, gestational diabetes effects.",
    "when_to_seek_medical_help": "For less than 10 movements in 2 hours, regular painful contractions, fluid leakage, bleeding, severe headaches, or vision changes."
  },
  {
    "id": 29,
    "week": 29,
    "trimester": 3,
    "phase": "Complex movements",
    "fetal_development": "Baby's movements now complex and purposeful - grasping, kicking, stretching. Less room means movements feel different - more rolls and stretches than somersaults. Eyes responding to light changes with pupil dilation. Primitive reflexes developing for survival after birth. Head growing rapidly to accommodate brain development. Bones hardening but skull remains soft for birth.",
    "maternal_hormones": "Sleep difficulties from size, discomfort, and baby's activity. Partners often sleep separately for comfort. Leg cramps and restless leg syndrome common. Preparation nesting urges beginning.",
    "paternal_changes": "Baby's nighttime activity frustrating but normal - your movement during day rocks baby to sleep. Evening quiet time lets baby wake and exercise.",
    "medical_appointments": "Bi-weekly appointments continue. Monitoring for complications increases. Birth plan discussions.",
    "baby_size_comparison": "a butternut squash",
    "baby_size_inches": 15.2,
    "baby_weight_grams": 1150,
    "emotional_patterns": "Sleep disruption affecting relationship, preparation tasks feeling urgent, baby's personality emerging through movement patterns, anticipation and anxiety mixing.",
    "anxiety_triggers": "Sleep arrangement changes, exhaustion affecting daily life, worry about baby's activity patterns, preparation task overwhelm, maintaining relationship connection.",
    "bonding_opportunities": "Understand baby's reverse schedule - active when mom rests. Create comfortable sleep setup even if means temporary separate beds. Evening bonding time.",
    "actionable_tasks": "Help find comfortable sleep positions, consider pregnancy pillow, take over night duties (bathroom trips), establish evening talk-to-baby routine.",
    "common_questions": "Why most active at night? Is separate sleeping okay? How do we manage exhaustion? What preparations are critical?",
    "safety_considerations": "Baby's schedule opposite of adults - will need adjustment after birth too. Movement during day lulls baby; stillness lets them exercise.",
    "communication_focus": "Flexible sleep arrangements preserve rest and relationship - temporary adjustments for health aren't relationship failures.",
    "did_you_know": "Baby's brain creating 250,000 neurons per minute during growth spurts. This rapid development requires enormous energy, explaining increased maternal fatigue and hunger.",
    "maternal_symptoms_changes": "Severe sleep disruption, leg cramps nightly, baby very active during rest, shortness of breath worse lying down, hemorrhoids from pressure, mood affected by exhaustion.",
    "risk_indicators": "Signs of preterm labor, severe swelling indicating preeclampsia, decreased fetal movement patterns.",
    "when_to_seek_medical_help": "For regular contractions, decreased movement, severe swelling especially face/hands, severe headaches, or vision disturbances."
  },
  {
    "id": 30,
    "week": 30,
    "trimester": 3,
    "phase": "Temperature control",
    "fetal_development": "Major achievement: baby can now regulate body temperature, though still needs maternal warmth. Eyes developing ability to track movement. Bone marrow taking over blood cell production from spleen. About 1.5 liters amniotic fluid surrounds baby. Growth rate approximately half pound per week. Sleep cycles more defined with quiet and active periods.",
    "maternal_hormones": "Balance and coordination affected by shifted center of gravity. Clumsy feelings normal but frustrating. Mood swings from hormones and discomfort. Braxton Hicks increasing.",
    "paternal_changes": "Supporting partner through clumsiness requires patience and practical help. Remove tripping hazards, provide physical support, understand frustration.",
    "medical_appointments": "Regular monitoring continues. Growth assessments through fundal height. Preterm labor education.",
    "baby_size_comparison": "a large cabbage",
    "baby_size_inches": 15.7,
    "baby_weight_grams": 1300,
    "emotional_patterns": "Partner's vulnerability from physical changes, birth approaching feeling real, preparation reaching critical phase, protective instincts strengthening.",
    "anxiety_triggers": "Safety concerns about partner's balance, emotional volatility challenging, birth plan decisions pressing, managing increasing responsibilities.",
    "bonding_opportunities": "Clear walking paths, install grab bars in bathroom, accompany on stairs. Begin detailed birth discussions - preferences for labor support.",
    "actionable_tasks": "Make home safer for balance issues, research pain management options together, practice comfort measures, finalize birth preferences.",
    "common_questions": "Is clumsiness dangerous? How can I help her feel safer? What birth decisions do we need to make? Should we tour hospital?",
    "safety_considerations": "Balance issues from relaxin hormone loosening joints plus shifted center of gravity. Falls risk real - prevention important.",
    "communication_focus": "Birth plan discussions deepen partnership - understanding options together helps you advocate effectively during labor.",
    "did_you_know": "Baby's eyes can now track movement and will follow light sources. After birth, baby will prefer faces and can focus about 8-12 inches - perfect distance for feeding and bonding.",
    "maternal_symptoms_changes": "Significant clumsiness, emotional ups and downs, Braxton Hicks more frequent, pelvic pressure increasing, fatigue significant, nesting urges beginning.",
    "risk_indicators": "Falls risk from balance issues, preterm labor signs, gestational hypertension development.",
    "when_to_seek_medical_help": "For any falls especially on abdomen, regular contractions before 37 weeks, severe headaches, or decreased movement."
  },
  {
    "id": 31,
    "week": 31,
    "trimester": 3,
    "phase": "Rapid weight gain",
    "fetal_development": "Baby gaining rapidly - about half their birth weight comes in final 9 weeks. All five senses functioning. Can distinguish light and dark, taste sweet vs bitter, hear and recognize voices, feel touch, and smell through amniotic fluid. Major organs mature except lungs still need several weeks. Survival excellent if born but NICU stay likely.",
    "maternal_hormones": "Significant discomfort from size. Organs compressed causing heartburn, breathlessness, frequent urination. Energy for nesting competing with exhaustion. Stretch marks may increase.",
    "paternal_changes": "Understanding rapid growth helps explain increasing discomfort. Every pound baby gains directly impacts partner's body. Patience and support crucial.",
    "medical_appointments": "Bi-weekly appointments. May begin cervical checks in some practices. Discussion of labor signs.",
    "baby_size_comparison": "a coconut",
    "baby_size_inches": 16.2,
    "baby_weight_grams": 1500,
    "emotional_patterns": "Discomfort empathy deepening, nesting instincts shared by fathers too, anticipation building, preparation tasks urgent, protectiveness increasing.",
    "anxiety_triggers": "Partner's pain concerning, balancing rest with preparation, managing nesting impulses, worry about premature labor, relationship strain from discomfort.",
    "bonding_opportunities": "Support nesting wisely - help channel energy into useful preparation while ensuring adequate rest. Share your own nesting feelings.",
    "actionable_tasks": "Create freezer meal prep sessions, organize baby items together, ensure hospital bag started, practice infant care skills.",
    "common_questions": "How do we balance nesting with rest? What if labor starts now? Are we prepared enough? Why such intense discomfort?",
    "safety_considerations": "Nesting is biological imperative for both parents - channel productively but don't exhaust. Baby items can be organized from sitting position.",
    "communication_focus": "Recognizing father's nesting instincts validates involvement - you're biologically programmed to prepare safe environment too.",
    "did_you_know": "Baby's brain developing individual personality traits. The neural pathways forming now influence temperament, sleep patterns, and activity levels that persist after birth.",
    "maternal_symptoms_changes": "Major discomfort from organ compression, heartburn severe, breathing restricted, stretch marks possibly increasing, strong nesting urges, energy bursts between exhaustion.",
    "risk_indicators": "Preterm labor risk continues, signs of preeclampsia, excessive swelling, decreased movement concerning.",
    "when_to_seek_medical_help": "For regular contractions, fluid leakage, decreased movement, severe upper abdominal pain, or visual disturbances."
  },
  {
    "id": 32,
    "week": 32,
    "trimester": 3,
    "phase": "Skin development",
    "fetal_development": "Baby's skin becoming opaque as fat accumulates. Lanugo (fine hair) beginning to disappear except on back and shoulders. Fingernails reaching fingertips. Practicing breathing movements though lungs still immature. All babies look similar at this stage regardless of ethnicity - individual features emerge later. Sleep 90-95% of the day.",
    "maternal_hormones": "Belly expansion significant - skin stretching may cause itching. Self-image challenges as body changes dramatically. Appetite may decrease as stomach compressed. Vivid dreams about baby common.",
    "paternal_changes": "Supporting body image crucial as changes accelerate. Focus on amazing accomplishment of growing baby rather than appearance changes. Stretch marks fade.",
    "medical_appointments": "Regular monitoring. Growth assessments important. May discuss signs of labor approaching.",
    "baby_size_comparison": "a jicama",
    "baby_size_inches": 16.7,
    "baby_weight_grams": 1700,
    "emotional_patterns": "Body image support needed, birth preparation intensifying, baby shower timing typical, reality of parenthood imminent, excitement despite challenges.",
    "anxiety_triggers": "Partner's self-image concerns, stretch marks worry, managing celebrations while exhausted, final preparation pressure, intimacy challenges.",
    "bonding_opportunities": "Reassure about body changes - growing human is incredible accomplishment. Plan baby shower if desired. Maintain intimacy creatively.",
    "actionable_tasks": "Help with stretch mark care if desired (mainly for comfort), coordinate baby shower planning, express attraction verbally, prepare for parental leave.",
    "common_questions": "Will stretch marks go away? Do you still find me attractive? Are we ready for baby shower? What's left to prepare?",
    "safety_considerations": "Stretch marks affect 50-90% of pregnancies, largely genetic. They fade significantly postpartum from red/purple to silver/white.",
    "communication_focus": "Verbal affirmation especially important as body image challenges peak - specific compliments about strength and capability help.",
    "did_you_know": "In boys, testicles descending from abdomen to scrotum - occasionally one remains undescended at birth requiring monitoring. This descent is triggered by hormonal signals unique to male development.",
    "maternal_symptoms_changes": "Significant belly growth, skin itching from stretching, possible stretch marks, decreased appetite, vivid dreams, movement patterns changing with less room.",
    "risk_indicators": "Severe itching (cholestasis), decreased movement, signs of preterm labor continuing.",
    "when_to_seek_medical_help": "For severe itching especially palms/soles, significant decrease in movement, regular contractions, or fluid leakage."
  },
  {
    "id": 33,
    "week": 33,
    "trimester": 3,
    "phase": "Nervous system complete",
    "fetal_development": "Remarkable milestone: baby's brain and nervous system now fully developed, though continuing to mature. Pupils dilate and constrict in response to light. Baby likely head-down in preparation for birth. Less amniotic fluid relative to baby size means movements visible from outside. Rapid weight gain continuing - about 8 ounces weekly.",
    "maternal_hormones": "May begin leaking colostrum - early breast milk rich in antibodies. Varicose veins possible from pressure and increased blood volume. Emotional sensitivity high as hormones surge. Pelvic pressure increasing.",
    "paternal_changes": "Partner's emotional sensitivity requires extra gentleness. Physical and hormonal changes combine to create vulnerability needing patient support.",
    "medical_appointments": "Bi-weekly appointments continue. May check baby's position. Breastfeeding preparation discussions.",
    "baby_size_comparison": "a pineapple",
    "baby_size_inches": 17.2,
    "baby_weight_grams": 1900,
    "emotional_patterns": "Emotional support crucial, breastfeeding preparation beginning, labor feeling imminent, final preparations urgent, parental identity solidifying.",
    "anxiety_triggers": "Breastfeeding uncertainty and pressure, partner's emotional volatility, varicose vein discomfort, feeling unprepared despite preparations, work transition stress.",
    "bonding_opportunities": "Learn about breastfeeding support role - partners crucial for success. Provide emotional reassurance during hormonal surges. Express confidence in parenting abilities.",
    "actionable_tasks": "Research breastfeeding support techniques, help with varicose vein relief (elevation, compression), finalize work arrangements, practice calming techniques.",
    "common_questions": "How do I support breastfeeding? What about formula? Are mood swings normal? Should we feel more ready?",
    "safety_considerations": "Breastfeeding succeeds with partner support - you'll help with positioning, encouragement, and practical needs during feeding sessions.",
    "communication_focus": "Validating emotional experiences while maintaining stability - hormonal changes are real and temporary. Your steady presence helps.",
    "did_you_know": "Baby's immune system receiving antibody boost through placenta, providing protection for first months after birth. Colostrum will continue this protection - liquid gold for newborns.",
    "maternal_symptoms_changes": "Colostrum leaking possible, varicose veins in legs/vulva, high emotional sensitivity, pelvic pressure significant, sleep very disrupted, movement visible externally.",
    "risk_indicators": "Severe mood changes possibly indicating depression/anxiety, decreased movement, preterm labor signs.",
    "when_to_seek_medical_help": "For severe mood changes affecting function, thoughts of harm, decreased movement, or signs of labor before 37 weeks."
  },
  {
    "id": 34,
    "week": 34,
    "trimester": 3,
    "phase": "Fingernail completion",
    "fetal_development": "Baby's fingernails now reach fingertips - may need trimming at birth! Central nervous system and lungs maturing rapidly. If born now, likely short NICU stay or possibly none. Vernix caseosa thickening for skin protection during birth. Baby recognizes music and voices, showing preferences. About 5 pounds typical weight.",
    "maternal_hormones": "Pelvic pressure intense as baby settles lower. Sleep extremely difficult between discomfort and anxiety. Nesting urges may intensify. Swelling in feet and ankles common.",
    "paternal_changes": "Creating optimal sleep environment crucial even if sleep remains elusive. This preparation helps postpartum recovery too when sleep is precious.",
    "medical_appointments": "Regular appointments. Group B strep test typically performed. Final birth preparation discussions.",
    "baby_size_comparison": "a cantaloupe",
    "baby_size_inches": 17.7,
    "baby_weight_grams": 2100,
    "emotional_patterns": "Sleep deprivation affecting both partners, labor anticipation anxiety, final preparation checklist mode, increasing medicalization with tests, readiness questioning.",
    "anxiety_triggers": "Exhaustion management, creating perfect sleep setup, interpreting every symptom as labor, test results anxiety, overwhelming preparation lists.",
    "bonding_opportunities": "Accept sleep challenges while optimizing comfort - multiple pillows, cool room, white noise. Practice infant soothing techniques together.",
    "actionable_tasks": "Create ideal sleep environment, practice diaper changes and swaddling, ensure car seat installed, finish hospital bag.",
    "common_questions": "How will we handle newborn sleep deprivation? Are these labor signs? What if GBS positive? Are we really ready?",
    "safety_considerations": "Group B strep affects 25% of women - IV antibiotics during labor prevent transmission to baby. Positive result just means extra precaution.",
    "communication_focus": "Practicing infant care skills builds confidence - fumbling with first diaper better at home than hospital. Competence comes with practice.",
    "did_you_know": "Baby's lungs almost mature - surfactant production usually adequate by now. This substance prevents lung collapse, explaining why 34-weekers often need minimal respiratory support.",
    "maternal_symptoms_changes": "Intense pelvic pressure, severe sleep disruption, strong nesting urges, swelling in extremities, feeling baby has 'dropped', exhaustion profound.",
    "risk_indicators": "Signs of preeclampsia increasing, severe swelling, decreased movement, preterm labor before 37 weeks.",
    "when_to_seek_medical_help": "For severe headaches, visual changes, upper abdominal pain, decreased movement, or regular contractions before 37 weeks."
  },
  {
    "id": 35,
    "week": 35,
    "trimester": 3,
    "phase": "Feeding preparation",
    "fetal_development": "Baby mastering sucking and swallowing reflexes for feeding readiness. Most lanugo disappeared. Kidneys fully developed. Liver processing waste products. If born now, usually just observation needed, not NICU. Weight gain about 8 ounces weekly. Movement patterns strong but less dramatic due to space constraints.",
    "maternal_hormones": "Significant fatigue competing with nesting urges. May notice fluid leaking (urine or amniotic fluid?). Anxiety about distinguishing labor signs. Feeling 'done' with pregnancy common.",
    "paternal_changes": "Balance supporting nesting energy with enforcing rest. Partner may push too hard preparing, risking exhaustion before labor. Protection needed.",
    "medical_appointments": "Bi-weekly appointments. Position checks. May begin cervical checks. Labor signs education reinforced.",
    "baby_size_comparison": "a honeydew melon",
    "baby_size_inches": 18.2,
    "baby_weight_grams": 2400,
    "emotional_patterns": "Nesting intensity requiring boundaries, labor sign vigilance, feeling unprepared despite preparations, protectiveness peaking, anticipation/anxiety mixture.",
    "anxiety_triggers": "Fluid leakage uncertainty, nesting vs rest balance, work wrap-up stress, false labor confusion, feeling perpetually behind in preparations.",
    "bonding_opportunities": "Monitor nesting energy - encourage preparation but enforce rest breaks. Learn to check for amniotic fluid vs urine (amniotic fluid continues leaking, clear/odorless).",
    "actionable_tasks": "Finalize work handoffs, pack hospital bag completely, arrange pet/home care, practice labor support techniques, ensure postpartum supplies ready.",
    "common_questions": "Is that amniotic fluid? How do we know real labor? Can we nest too much? What absolutely must be done?",
    "safety_considerations": "Amniotic fluid leak: continuous, clear, odorless, can't control. Urine: stops/starts, yellowish, ammonia smell. When uncertain, get checked.",
    "communication_focus": "Balancing preparation with rest - exhaustion before labor unhelpful. Prioritize essential tasks only. Baby needs parents more than perfect nursery.",
    "did_you_know": "Baby's reflexes now include sucking, swallowing, grasping, and startle response. These primitive reflexes ensure survival - baby can feed immediately after birth if needed.",
    "maternal_symptoms_changes": "Extreme fatigue fighting nesting urges, possible fluid leaking concerns, anxiety about labor signs, feeling physically 'done', movement strong but different pattern.",
    "risk_indicators": "Premature rupture of membranes, signs of labor before 37 weeks, decreased movement patterns.",
    "when_to_seek_medical_help": "For fluid leakage suspicions, decreased movement, regular contractions, or severe fatigue affecting function. Also for labor sign clarification."
  },
  {
    "id": 36,
    "week": 36,
    "trimester": 3,
    "phase": "Birth positioning",
    "fetal_development": "Most babies now head-down (vertex position) preparing for birth. 'Lightening' may occur - baby drops into pelvis improving breathing but increasing pelvic pressure. Digestive system ready for milk processing. Immune system boosted by maternal antibodies. Sleep-wake cycles established. Considered 'late preterm' if born - usually healthy but may need minor support.",
    "maternal_hormones": "Lightening brings easier breathing but intense pelvic pressure, feeling baby might 'fall out.' More frequent Braxton Hicks. Cervix may begin softening and dilating. Nesting urgency intense.",
    "paternal_changes": "Understanding lightening helps interpret symptoms correctly. Improved breathing traded for pelvic pressure is normal progression toward birth readiness.",
    "medical_appointments": "Weekly appointments typically begin. Cervical checks more common. Position confirmation important. Birth plan finalization.",
    "baby_size_comparison": "a head of romaine lettuce",
    "baby_size_inches": 18.7,
    "baby_weight_grams": 2600,
    "emotional_patterns": "Birth feeling imminent, relief if breathing easier, final preparation urgency, heightened alertness for labor signs, protectiveness intensifying.",
    "anxiety_triggers": "Pelvic pressure discomfort, false vs real labor confusion, final task overwhelm, managing others' expectations, physical misery tolerance.",
    "bonding_opportunities": "Stay close to home. Practice timing contractions. Review labor signs. Express confidence in partner's birthing ability.",
    "actionable_tasks": "Keep gas tank full, phone charged, practice hospital route, review birth preferences, ensure support person arrangements confirmed.",
    "common_questions": "Is this labor? Should we go to hospital? What if baby comes quickly? Are contractions real?",
    "safety_considerations": "Lightening doesn't mean immediate labor - can be days or weeks. Increased pressure and contractions normal. Real labor: regular, intensifying, don't stop with rest.",
    "communication_focus": "Staying prepared but patient - most first babies don't come early. Each day benefits baby's development. Trust the process.",
    "did_you_know": "Baby is 'late preterm' - mature enough for survival but benefits from additional development. Each day reduces risk of feeding difficulties, temperature regulation issues, and NICU admission.",
    "maternal_symptoms_changes": "Lightening possible with easier breathing but intense pelvic pressure, frequent strong Braxton Hicks, cervical changes possible, nesting urgent, sleep near impossible.",
    "risk_indicators": "Regular contractions becoming painful and frequent, bloody show, fluid leakage, decreased movement.",
    "when_to_seek_medical_help": "For regular contractions 5-7 minutes apart, bloody show, fluid leakage, decreased movement, or uncertainty about labor beginning."
  },
  {
    "id": 37,
    "week": 37,
    "trimester": 3,
    "phase": "Early term begins",
    "fetal_development": "Congratulations - baby now 'early term!' Birth any time considered normal. All systems ready for outside world. Practicing breathing movements. Firm grasp reflex developed. Can differentiate between hundreds of sounds. Fat layers providing chubby newborn appearance. Average 6.5 pounds but wide variation normal.",
    "maternal_hormones": "Cervix may begin effacing (thinning) and dilating. Possible bloody show or mucus plug loss. Energy burst or deep exhaustion both normal. Every twinge analyzed as potential labor. Maximum discomfort reached.",
    "paternal_changes": "High alert status appropriate - labor could begin any time. Stay within reasonable distance of hospital. Trust partner's instincts about changes.",
    "medical_appointments": "Weekly appointments with cervical checks common. Non-stress tests may begin. Reviewing labor signs and when to come to hospital.",
    "baby_size_comparison": "a bunch of swiss chard",
    "baby_size_inches": 19.1,
    "baby_weight_grams": 2900,
    "emotional_patterns": "Labor readiness creating vigilance, every symptom analyzed, excitement about meeting baby, final preparations, deep protectiveness of partner.",
    "anxiety_triggers": "False alarm embarrassment fears, when to go to hospital uncertainty, managing daily life while expecting labor, others' impatience, exhaustion from waiting.",
    "bonding_opportunities": "Stay close to home. Keep hospital bag in car. Practice final comfort measures. Trust instincts about changes. Remind partner baby comes when ready.",
    "actionable_tasks": "Maintain readiness routines, support patience with waiting, handle others' inquiries, ensure all contact numbers current, review infant care basics.",
    "common_questions": "Is this it? When do we go to hospital? What if we're sent home? Why hasn't labor started?",
    "safety_considerations": "Early labor can start/stop for days. True labor: contractions regular, increasing intensity, don't stop with position change. When uncertain, call provider.",
    "communication_focus": "Managing anticipation and others' expectations - baby follows own timeline. Due dates are estimates. Focus on readiness, not dates.",
    "did_you_know": "Baby officially 'early term' - survival and outcomes essentially same as full term. Lungs mature, brain ready for outside stimulation, all systems prepared for independent life.",
    "maternal_symptoms_changes": "Cervical changes possible, bloody show or mucus plug loss possible, energy burst or exhaustion, every sensation analyzed, maximum physical discomfort.",
    "risk_indicators": "Active labor signs, decreased movement concerning at any stage, water breaking requiring immediate evaluation.",
    "when_to_seek_medical_help": "For regular painful contractions, water breaking, bloody show, decreased movement, or strong instinct something changing."
  },
  {
    "id": 38,
    "week": 38,
    "trimester": 3,
    "phase": "Final maturation",
    "fetal_development": "Baby's development complete - just adding final fat layers. Nervous system fully mature. Lungs producing adequate surfactant. Practicing sucking and swallowing constantly. Hair may be several inches long. Eye color established though may change in first year. Perfect readiness for birth achieved.",
    "maternal_hormones": "False labor common - contractions may be regular then stop. Extreme discomfort from size and position. Emotional rollercoaster of anticipation and impatience. Every movement or quiet moment analyzed.",
    "paternal_changes": "Managing false labor frustration requires patience and humor. Understanding it's body's practice helps cope with disappointment when contractions stop.",
    "medical_appointments": "Weekly appointments continue. May discuss induction if medical indications. Monitoring baby's wellbeing closely.",
    "baby_size_comparison": "a leek",
    "baby_size_inches": 19.6,
    "baby_weight_grams": 3100,
    "emotional_patterns": "Impatience growing daily, false labor frustration, physical misery acknowledged, anticipation peak, questioning everything as labor sign.",
    "anxiety_triggers": "False labor emotional rollercoaster, physical discomfort extreme, others' constant inquiries, work obligations if still working, exhaustion profound.",
    "bonding_opportunities": "Help distinguish false from real labor. Provide distractions during waiting. Express confidence labor will begin when ready. Maximum comfort support.",
    "actionable_tasks": "Time contractions when regular, provide entertainment during waiting, handle communication with others, maintain normal routines when possible.",
    "common_questions": "Why false labor? Should we help things along? Is baby okay? When will this end?",
    "safety_considerations": "False labor prepares cervix and uterus for real labor - not wasted effort. Baby initiates labor through hormone signals when fully ready.",
    "communication_focus": "Patience with process - average first pregnancy goes to 40 weeks 5 days. Each day allows final brain development and fat accumulation.",
    "did_you_know": "Baby's brain developing at extraordinary rate - adding 1.5% of body weight in brain mass these final weeks. This final development enhances temperature regulation and feeding coordination.",
    "maternal_symptoms_changes": "Extreme discomfort universal, false labor episodes, cervical changes progressing, exhaustion from poor sleep, emotions varying wildly, ready for pregnancy completion.",
    "risk_indicators": "True labor beginning, decreased movement patterns, water breaking, any concerning symptoms.",
    "when_to_seek_medical_help": "For regular contractions lasting 60 seconds every 5 minutes for 1 hour, water breaking, decreased movement, or any concerns."
  },
  {
    "id": 39,
    "week": 39,
    "trimester": 3,
    "phase": "Full term optimal",
    "fetal_development": "Full term! This is optimal timing for birth. Baby's brain continuing rapid development - final neural connections for temperature regulation, breathing coordination, and feeding reflexes. Antibodies crossing placenta providing immunity boost. Position usually firmly head-down. All systems optimized for transition to outside world.",
    "maternal_hormones": "Could begin labor any moment. Energy may surge (impending labor sign) or exhaustion deepen. Cervical changes accelerating. Increased discharge normal. Every hour wondering 'is this it?' Sleeping nearly impossible from discomfort and anticipation.",
    "paternal_changes": "Maintaining calm supportive presence despite own anxiety. Partner needs steady reassurance while navigating uncertainty. Your stability helps her confidence.",
    "medical_appointments": "Weekly appointments monitoring progress. May sweep membranes if dilated. Discussion of going past due date. Non-stress tests ensuring baby's wellbeing.",
    "baby_size_comparison": "a small pumpkin",
    "baby_size_inches": 19.9,
    "baby_weight_grams": 3300,
    "emotional_patterns": "Full term milestone reached, readiness complete, moment could come anytime, anticipation/anxiety peak, protective instincts maximum.",
    "anxiety_triggers": "Constant vigilance exhausting, interpreting every sign, managing others' expectations, maintaining normal life impossible, emotional intensity extreme.",
    "bonding_opportunities": "Be ready for labor anytime. Maintain calm presence. Practice relaxation techniques together. Express love and confidence frequently.",
    "actionable_tasks": "Stay perpetually ready, keep phones charged, review birth plan together, practice breathing techniques, ensure nothing left undone.",
    "common_questions": "Are we really ready? What if something goes wrong? Why hasn't labor started? Should we try natural induction?",
    "safety_considerations": "Natural induction methods have limited evidence. Baby initiates labor through complex hormone cascade when ready. Trust the process.",
    "communication_focus": "Focusing on readiness rather than timing - you're prepared, baby's prepared, trust body's wisdom. Each person's timing unique.",
    "did_you_know": "Baby's brain nearly doubles in weight during third trimester, with these final weeks crucial for coordination centers. This explains why full-term babies feed and regulate temperature better than early arrivals.",
    "maternal_symptoms_changes": "Any moment readiness, possible energy surge, cervical changes likely, discharge increasing, emotions intense, sleep nearly impossible, maximum discomfort reached.",
    "risk_indicators": "Active labor beginning, water breaking, decreased movement, bleeding beyond bloody show.",
    "when_to_seek_medical_help": "For regular contractions, water breaking, significant bleeding, decreased movement, or strong feeling labor beginning."
  },
  {
    "id": 40,
    "week": 40,
    "trimester": 3,
    "phase": "Due date arrival",
    "fetal_development": "Due date! Remember only 5% of babies arrive on their actual due date. Baby completely ready - average 7.5 pounds, 20 inches long. Vernix mostly gone except in skin folds. Fingernails may extend beyond fingertips. All systems perfectly developed for life outside. Baby's timing remains mysterious but imminent.",
    "maternal_hormones": "If no labor signs, anxiety about 'overdue' common. Continued cervical changes. May have membrane sweep to encourage labor. Discussion of induction timing. Every day past due date increases questions from others.",
    "paternal_changes": "Supporting partner through due date pressure. Others' inquiries add stress. Remind that 'overdue' is normal variation, not failure.",
    "medical_appointments": "Appointments may increase to twice weekly. Non-stress tests monitoring baby. Biophysical profiles assessing wellbeing. Induction scheduling if indicated.",
    "baby_size_comparison": "a watermelon",
    "baby_size_inches": 20.2,
    "baby_weight_grams": 3400,
    "emotional_patterns": "Due date significance creating pressure, others' constant contact, questioning body's process, induction discussions, emotional extremes.",
    "anxiety_triggers": "Overdue anxiety, fielding constant inquiries, induction decision stress, doubting body's ability, exhaustion from waiting, relationship strain.",
    "bonding_opportunities": "Shield from others' pressure. Express confidence in body's timing. Support whatever decision about waiting vs induction. Prepare for most amazing day.",
    "actionable_tasks": "Manage communications with others, support induction discussions, maintain readiness, express love and pride, prepare for life transformation.",
    "common_questions": "Why hasn't baby come? Should we induce? Is something wrong? How long can we wait?",
    "safety_considerations": "Post-dates monitoring ensures baby's wellbeing. Placenta efficiency decreases gradually after 42 weeks. Most providers recommend delivery by 42 weeks.",
    "communication_focus": "Trusting the process while accepting medical guidance - balance between patience and safety. Your baby will arrive soon.",
    "did_you_know": "Only 5% deliver on due date - normal range is 37-42 weeks. Dating uncertainty, individual variation, and baby's readiness all affect timing. Your baby knows when they're ready.",
    "maternal_symptoms_changes": "Due date anxiety if not delivered, continued discomfort, possible induction discussions, cervical changes continuing, exhaustion from waiting, emotional intensity.",
    "risk_indicators": "Post-dates requiring monitoring, decreased movement, any labor signs, induction timing decisions.",
    "when_to_seek_medical_help": "For biophysical profiles, non-stress tests, induction discussions, any labor signs, or decreased movement. Trust provider guidance on timing."
  }
]
